; ModuleID = 'gzip.bc'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.config = type { i16, i16, i16, i16 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.timespec = type { i64, i64 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.__sigset_t = type { [16 x i64] }
%struct.ct_data = type { %union.anon.5, %union.anon.5 }
%union.anon.5 = type { i16 }
%struct.tree_desc = type { %struct.ct_data*, %struct.ct_data*, i32*, i32, i32, i32, i32 }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, void ()* }
%union.anon = type { void (i32)* }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.__dirstream = type opaque
%struct.huft = type { i8, i8, %union.anon.0 }
%union.anon.0 = type { %struct.huft* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.direntry_t = type { i8* }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }


!22 = distinct !DIGlobalVariable(name: "read_buf", scope: !2, file: !3, line: 96, type: !23, isLocal: false, isDefinition: true)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DISubroutineType(types: !25)
!25 = !{!6, !26, !28}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!28 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "compr_level", scope: !31, file: !32, line: 218, type: !6, isLocal: true, isDefinition: true)
!31 = distinct !DICompileUnit(language: DW_LANG_C99, file: !32, producer: "clang version 10.0.0 (GraalVM.org llvmorg-10.0.0-5-g67b19b2aed-bgb23ce12f48 67b19b2aedf7dca7524aa26ac6b420213017c8e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !33, globals: !52, splitDebugInlining: false, nameTableKind: None)
!32 = !DIFile(filename: "deflate.c", directory: "/home/arthur/Downloads/gzip-1.10", checksumkind: CSK_MD5, checksum: "5ea8cf5b204bd91b7bc0b334878a390d")
!33 = !{!34, !39, !26, !28, !41, !40, !44, !45, !49, !50, !51, !6}
!34 = !DISubprogram(name: "gzip_error", scope: !8, file: !8, line: 308, type: !35, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !4)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !37}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidp", file: !8, line: 23, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!41 = !DISubprogram(name: "ct_tally", scope: !8, file: !8, line: 283, type: !42, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!42 = !DISubroutineType(types: !43)
!43 = !{!6, !6, !6}
!44 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!45 = !DISubprogram(name: "flush_block", scope: !8, file: !8, line: 284, type: !46, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!46 = !DISubroutineType(types: !47)
!47 = !{!44, !26, !48, !6, !6}
!48 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "ulg", file: !8, line: 48, baseType: !48)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pos", file: !32, line: 147, baseType: !10)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPos", file: !32, line: 148, baseType: !28)
!52 = !{!53, !55, !57, !59, !61, !63, !65, !67, !69, !29, !71, !73, !75, !77, !79, !91}
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "block_start", scope: !31, file: !32, line: 178, type: !44, isLocal: false, isDefinition: true)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "ins_h", scope: !31, file: !32, line: 183, type: !28, isLocal: true, isDefinition: true)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "prev_length", scope: !31, file: !32, line: 192, type: !28, isLocal: false, isDefinition: true)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "strstart", scope: !31, file: !32, line: 197, type: !28, isLocal: false, isDefinition: true)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "match_start", scope: !31, file: !32, line: 198, type: !28, isLocal: false, isDefinition: true)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "eofile", scope: !31, file: !32, line: 199, type: !6, isLocal: true, isDefinition: true)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "lookahead", scope: !31, file: !32, line: 200, type: !28, isLocal: true, isDefinition: true)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "max_chain_length", scope: !31, file: !32, line: 202, type: !28, isLocal: false, isDefinition: true)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "max_lazy_match", scope: !31, file: !32, line: 207, type: !28, isLocal: true, isDefinition: true)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "good_match", scope: !31, file: !32, line: 221, type: !28, isLocal: false, isDefinition: true)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "rsync_sum", scope: !31, file: !32, line: 224, type: !49, isLocal: true, isDefinition: true)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "rsync_chunk_end", scope: !31, file: !32, line: 225, type: !49, isLocal: true, isDefinition: true)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "nice_match", scope: !31, file: !32, line: 250, type: !6, isLocal: true, isDefinition: true)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "configuration_table", scope: !31, file: !32, line: 253, type: !81, isLocal: true, isDefinition: true)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 640, elements: !89)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "config", file: !32, line: 238, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "config", file: !32, line: 233, size: 64, elements: !84)
!84 = !{!85, !86, !87, !88}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "good_length", scope: !83, file: !32, line: 234, baseType: !10, size: 16)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "max_lazy", scope: !83, file: !32, line: 235, baseType: !10, size: 16, offset: 16)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "nice_length", scope: !83, file: !32, line: 236, baseType: !10, size: 16, offset: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "max_chain", scope: !83, file: !32, line: 237, baseType: !10, size: 16, offset: 48)
!89 = !{!90}
!90 = !DISubrange(count: 10, lowerBound: 0)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "window_size", scope: !31, file: !32, line: 173, type: !49, isLocal: true, isDefinition: true)
!93 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "program_name", scope: !96, file: !97, line: 170, type: !26, isLocal: false, isDefinition: true)
!96 = distinct !DICompileUnit(language: DW_LANG_C99, file: !97, producer: "clang version 10.0.0 (GraalVM.org llvmorg-10.0.0-5-g67b19b2aed-bgb23ce12f48 67b19b2aedf7dca7524aa26ac6b420213017c8e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !98, retainedTypes: !115, globals: !476, splitDebugInlining: false, nameTableKind: None)
!97 = !DIFile(filename: "gzip.c", directory: "/home/arthur/Downloads/gzip-1.10", checksumkind: CSK_MD5, checksum: "ae40f9d559444310bb409e95f210bf48")
!98 = !{!99, !105, !109}
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !97, line: 246, baseType: !28, size: 32, elements: !100)
!100 = !{!101, !102, !103, !104}
!101 = !DIEnumerator(name: "PRESUME_INPUT_TTY_OPTION", value: 128, isUnsigned: true)
!102 = !DIEnumerator(name: "RSYNCABLE_OPTION", value: 129, isUnsigned: true)
!103 = !DIEnumerator(name: "SYNCHRONOUS_OPTION", value: 130, isUnsigned: true)
!104 = !DIEnumerator(name: "ENV_OPTION", value: 131, isUnsigned: true)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 48, baseType: !28, size: 32, elements: !107)
!106 = !DIFile(filename: "./lib/timespec.h", directory: "/home/arthur/Downloads/gzip-1.10", checksumkind: CSK_MD5, checksum: "c73625356e095e32b4364463fe9fa52b")
!107 = !{!108}
!108 = !DIEnumerator(name: "TIMESPEC_RESOLUTION", value: 1000000000, isUnsigned: true)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !110, line: 26, baseType: !28, size: 32, elements: !111)
!110 = !DIFile(filename: "./lib/savedir.h", directory: "/home/arthur/Downloads/gzip-1.10", checksumkind: CSK_MD5, checksum: "0c4fd91093d704cfbe62db0162e1a425")
!111 = !{!112, !113, !114}
!112 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0, isUnsigned: true)
!113 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1, isUnsigned: true)
!114 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 0, isUnsigned: true)
!115 = !{!116, !119, !125, !139, !143, !147, !148, !205, !206, !6, !124, !40, !207, !208, !249, !250, !253, !255, !7, !49, !256, !258, !27, !34, !262, !28, !26, !263, !264, !198, !48, !267, !268, !272, !286, !289, !292, !296, !299, !301, !302, !308, !311, !314, !319, !325, !328, !331, !333, !336, !10, !339, !360, !363, !375, !465, !468, !471, !474, !475}
!116 = !DISubprogram(name: "gzip_base_name", scope: !8, file: !8, line: 304, type: !117, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!117 = !DISubroutineType(types: !118)
!118 = !{!26, !26}
!119 = !DISubprogram(name: "add_envopt", scope: !8, file: !8, line: 307, type: !120, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!120 = !DISubroutineType(types: !121)
!121 = !{!26, !122, !123, !37}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!125 = !DISubprogram(name: "getopt_long", scope: !126, file: !126, line: 66, type: !127, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!126 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "23d11fe4b78944b561ebfc05b925daaf")
!127 = !DISubroutineType(types: !128)
!128 = !{!6, !6, !129, !37, !131, !122}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !126, line: 50, size: 256, elements: !134)
!134 = !{!135, !136, !137, !138}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !133, file: !126, line: 52, baseType: !37, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !133, file: !126, line: 55, baseType: !6, size: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !133, file: !126, line: 56, baseType: !122, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !133, file: !126, line: 57, baseType: !6, size: 32, offset: 192)
!139 = !DISubprogram(name: "free", scope: !140, file: !140, line: 565, type: !141, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!140 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "32dbbe9742ce68cd5089d66404ab1df2")
!141 = !DISubroutineType(types: !142)
!142 = !{null, !40}
!143 = !DISubprogram(name: "close", scope: !144, file: !144, line: 353, type: !145, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!144 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "21a987d2d4ed334656996076e1bf8e16")
!145 = !DISubroutineType(types: !146)
!146 = !{!6, !6}
!147 = !DISubprogram(name: "read_error", scope: !8, file: !8, line: 311, type: !13, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !4)
!148 = !DISubprogram(name: "rpl_fflush", scope: !149, file: !149, line: 712, type: !150, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!149 = !DIFile(filename: "./lib/stdio.h", directory: "/home/arthur/Downloads/gzip-1.10")
!150 = !DISubroutineType(types: !151)
!151 = !{!6, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !154, line: 49, size: 1728, elements: !155)
!154 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "daf3a34cdce4be51765788919d95b2d5")
!155 = !{!156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !171, !172, !173, !174, !177, !178, !180, !184, !187, !189, !192, !195, !196, !197, !200, !201}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !153, file: !154, line: 51, baseType: !6, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !153, file: !154, line: 54, baseType: !26, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !153, file: !154, line: 55, baseType: !26, size: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !153, file: !154, line: 56, baseType: !26, size: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !153, file: !154, line: 57, baseType: !26, size: 64, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !153, file: !154, line: 58, baseType: !26, size: 64, offset: 320)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !153, file: !154, line: 59, baseType: !26, size: 64, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !153, file: !154, line: 60, baseType: !26, size: 64, offset: 448)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !153, file: !154, line: 61, baseType: !26, size: 64, offset: 512)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !153, file: !154, line: 64, baseType: !26, size: 64, offset: 576)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !153, file: !154, line: 65, baseType: !26, size: 64, offset: 640)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !153, file: !154, line: 66, baseType: !26, size: 64, offset: 704)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !153, file: !154, line: 68, baseType: !169, size: 64, offset: 768)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !154, line: 36, flags: DIFlagFwdDecl)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !153, file: !154, line: 70, baseType: !152, size: 64, offset: 832)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !153, file: !154, line: 72, baseType: !6, size: 32, offset: 896)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !153, file: !154, line: 73, baseType: !6, size: 32, offset: 928)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !153, file: !154, line: 74, baseType: !175, size: 64, offset: 960)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !176, line: 152, baseType: !44)
!176 = !DIFile(filename: "/usr/include/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "58b79843d97f4309eefa4aa722dac91e")
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !153, file: !154, line: 77, baseType: !11, size: 16, offset: 1024)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !153, file: !154, line: 78, baseType: !179, size: 8, offset: 1040)
!179 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !153, file: !154, line: 79, baseType: !181, size: 8, offset: 1048)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 1, lowerBound: 0)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !153, file: !154, line: 81, baseType: !185, size: 64, offset: 1088)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !154, line: 43, baseType: null)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !153, file: !154, line: 89, baseType: !188, size: 64, offset: 1152)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !176, line: 153, baseType: !44)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !153, file: !154, line: 91, baseType: !190, size: 64, offset: 1216)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !154, line: 37, flags: DIFlagFwdDecl)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !153, file: !154, line: 92, baseType: !193, size: 64, offset: 1280)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !154, line: 38, flags: DIFlagFwdDecl)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !153, file: !154, line: 93, baseType: !152, size: 64, offset: 1344)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !153, file: !154, line: 94, baseType: !40, size: 64, offset: 1408)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !153, file: !154, line: 95, baseType: !198, size: 64, offset: 1472)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !199, line: 46, baseType: !48)
!199 = !DIFile(filename: "graalvm-ce-java11-linux-amd64-21.1.0/graalvm-ce-java11-21.1.0/lib/llvm/lib/clang/10.0.0/include/stddef.h", directory: "/home/arthur/Downloads", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !153, file: !154, line: 96, baseType: !6, size: 32, offset: 1536)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !153, file: !154, line: 98, baseType: !202, size: 160, offset: 1568)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 160, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 20, lowerBound: 0)
!205 = !DISubprogram(name: "write_error", scope: !8, file: !8, line: 312, type: !13, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !4)
!206 = !DISubprogram(name: "fdatasync", scope: !144, file: !144, line: 1129, type: !145, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!207 = !DISubprogram(name: "isatty", scope: !144, file: !144, line: 791, type: !145, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!208 = !DISubprogram(name: "fstat", scope: !209, file: !209, line: 210, type: !210, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!209 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "9baedd9c87fe459e16ce6189b87ae5d4")
!210 = !DISubroutineType(types: !211)
!211 = !{!6, !6, !212}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !214, line: 26, size: 1152, elements: !215)
!214 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "dae7fa8a56aae4b10f7521167039e3f0")
!215 = !{!216, !218, !220, !222, !224, !226, !228, !229, !230, !231, !233, !235, !243, !244, !245}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !213, file: !214, line: 28, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !176, line: 145, baseType: !48)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !213, file: !214, line: 33, baseType: !219, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !176, line: 148, baseType: !48)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !213, file: !214, line: 41, baseType: !221, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !176, line: 151, baseType: !48)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !213, file: !214, line: 42, baseType: !223, size: 32, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !176, line: 150, baseType: !28)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !213, file: !214, line: 44, baseType: !225, size: 32, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !176, line: 146, baseType: !28)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !213, file: !214, line: 45, baseType: !227, size: 32, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !176, line: 147, baseType: !28)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !213, file: !214, line: 47, baseType: !6, size: 32, offset: 288)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !213, file: !214, line: 49, baseType: !217, size: 64, offset: 320)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !213, file: !214, line: 54, baseType: !175, size: 64, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !213, file: !214, line: 58, baseType: !232, size: 64, offset: 448)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !176, line: 175, baseType: !44)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !213, file: !214, line: 60, baseType: !234, size: 64, offset: 512)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !176, line: 180, baseType: !44)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !213, file: !214, line: 71, baseType: !236, size: 128, offset: 576)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !237, line: 10, size: 128, elements: !238)
!237 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "33f28095c70788baa6982a79b13f774b")
!238 = !{!239, !241}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !236, file: !237, line: 12, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !176, line: 160, baseType: !44)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !236, file: !237, line: 16, baseType: !242, size: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !176, line: 197, baseType: !44)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !213, file: !214, line: 72, baseType: !236, size: 128, offset: 704)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !213, file: !214, line: 73, baseType: !236, size: 128, offset: 832)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !213, file: !214, line: 86, baseType: !246, size: 192, offset: 960)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 192, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 3, lowerBound: 0)
!249 = !DISubprogram(name: "clear_bufs", scope: !8, file: !8, line: 297, type: !13, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!250 = !DISubprogram(name: "display_ratio", scope: !8, file: !8, line: 313, type: !251, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!251 = !DISubroutineType(types: !252)
!252 = !{null, !44, !44, !152}
!253 = !DISubprogram(name: "perror", scope: !254, file: !254, line: 780, type: !35, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!254 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "56cc857d7acab866055f6cad20cd59e5")
!255 = !DISubprogram(name: "fill_inbuf", scope: !8, file: !8, line: 298, type: !145, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !257, line: 7, baseType: !240)
!257 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!258 = !DISubprogram(name: "updcrc", scope: !8, file: !8, line: 296, type: !259, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!259 = !DISubroutineType(types: !260)
!260 = !{!48, !261, !28}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!263 = !DISubprogram(name: "check_zipfile", scope: !8, file: !8, line: 266, type: !145, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!264 = !DISubprogram(name: "write_buf", scope: !8, file: !8, line: 301, type: !265, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !6, !40, !28}
!267 = !DISubprogram(name: "fsync", scope: !144, file: !144, line: 968, type: !145, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!268 = !DISubprogram(name: "last_component", scope: !269, file: !269, line: 46, type: !270, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!269 = !DIFile(filename: "./lib/dirname.h", directory: "/home/arthur/Downloads/gzip-1.10", checksumkind: CSK_MD5, checksum: "808798b4bfc8c59ec282fc78e94b75cb")
!270 = !DISubroutineType(types: !271)
!271 = !{!26, !37}
!272 = !DISubprogram(name: "sigprocmask", scope: !273, file: !273, line: 232, type: !274, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!273 = !DIFile(filename: "/usr/include/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "cec6b6c7cb3bb693e02d2bde9ada10e8")
!274 = !DISubroutineType(types: !275)
!275 = !{!6, !6, !276, !285}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !279, line: 5, size: 1024, elements: !280)
!279 = !DIFile(filename: "/usr/include/bits/types/__sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "acc6b14c0967857fec362a8d433e1cf2")
!280 = !{!281}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !278, file: !279, line: 7, baseType: !282, size: 1024)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 1024, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 16, lowerBound: 0)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!286 = !DISubprogram(name: "xunlink", scope: !8, file: !8, line: 305, type: !287, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!287 = !DISubroutineType(types: !288)
!288 = !{!6, !26}
!289 = !DISubprogram(name: "unlinkat", scope: !144, file: !144, line: 842, type: !290, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!290 = !DISubroutineType(types: !291)
!291 = !{!6, !6, !37, !6}
!292 = !DISubprogram(name: "openat_safer", scope: !293, file: !293, line: 26, type: !294, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!293 = !DIFile(filename: "./lib/fcntl-safer.h", directory: "/home/arthur/Downloads/gzip-1.10", checksumkind: CSK_MD5, checksum: "0500abbcd84b67111460a8dbf2983b19")
!294 = !DISubroutineType(types: !295)
!295 = !{!6, !6, !37, !6, null}
!296 = !DISubprogram(name: "open_safer", scope: !293, file: !293, line: 22, type: !297, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!297 = !DISubroutineType(types: !298)
!298 = !{!6, !37, !6, null}
!299 = !DISubprogram(name: "xstrdup", scope: !300, file: !300, line: 64, type: !270, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!300 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/arthur/Downloads/gzip-1.10", checksumkind: CSK_MD5, checksum: "fae4b5a9e057c2105d25ff0caef58f19")
!301 = !DISubprogram(name: "strlwr", scope: !8, file: !8, line: 303, type: !117, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!302 = !DISubprogram(name: "fdopendir", scope: !303, file: !303, line: 141, type: !304, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!303 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "8697773449a271ee4bccf8cc981fd001")
!304 = !DISubroutineType(types: !305)
!305 = !{!306, !6}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !303, line: 127, flags: DIFlagFwdDecl)
!308 = !DISubprogram(name: "streamsavedir", scope: !110, file: !110, line: 38, type: !309, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!309 = !DISubroutineType(types: !310)
!310 = !{!26, !306, !109}
!311 = !DISubprogram(name: "closedir", scope: !303, file: !303, line: 149, type: !312, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!312 = !DISubroutineType(types: !313)
!313 = !{!6, !306}
!314 = !DISubprogram(name: "yesno", scope: !315, file: !315, line: 22, type: !316, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!315 = !DIFile(filename: "./lib/yesno.h", directory: "/home/arthur/Downloads/gzip-1.10", checksumkind: CSK_MD5, checksum: "e6f7809a235622264bb6cbb0636e87ff")
!316 = !DISubroutineType(types: !317)
!317 = !{!318}
!318 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!319 = !DISubprogram(name: "fdutimens", scope: !320, file: !320, line: 21, type: !321, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!320 = !DIFile(filename: "./lib/utimens.h", directory: "/home/arthur/Downloads/gzip-1.10", checksumkind: CSK_MD5, checksum: "b3597b1303878e911fdcb8571812d323")
!321 = !DISubroutineType(types: !322)
!322 = !{!6, !6, !37, !323}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!325 = !DISubprogram(name: "fchmod", scope: !209, file: !209, line: 293, type: !326, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!326 = !DISubroutineType(types: !327)
!327 = !{!6, !6, !28}
!328 = !DISubprogram(name: "fchown", scope: !144, file: !144, line: 487, type: !329, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!329 = !DISubroutineType(types: !330)
!330 = !{!6, !6, !28, !28}
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !332, line: 85, baseType: !175)
!332 = !DIFile(filename: "/usr/include/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "ff9b9357c8c90c2cb36c365fa7f25a44")
!333 = !DISubprogram(name: "fprint_off", scope: !8, file: !8, line: 314, type: !334, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !152, !44, !6}
!336 = !DISubprogram(name: "lseek", scope: !144, file: !144, line: 334, type: !337, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!337 = !DISubroutineType(types: !338)
!338 = !{!44, !6, !44, !6}
!339 = !DISubprogram(name: "localtime", scope: !340, file: !340, line: 123, type: !341, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!340 = !DIFile(filename: "/usr/include/time.h", directory: "", checksumkind: CSK_MD5, checksum: "897a0ba0c1ee6913bcc6e7cb36625774")
!341 = !DISubroutineType(types: !342)
!342 = !{!343, !358}
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !345, line: 7, size: 448, elements: !346)
!345 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "", checksumkind: CSK_MD5, checksum: "9e5545b565ef031c4cd0faf90b69386f")
!346 = !{!347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !344, file: !345, line: 9, baseType: !6, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !344, file: !345, line: 10, baseType: !6, size: 32, offset: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !344, file: !345, line: 11, baseType: !6, size: 32, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !344, file: !345, line: 12, baseType: !6, size: 32, offset: 96)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !344, file: !345, line: 13, baseType: !6, size: 32, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !344, file: !345, line: 14, baseType: !6, size: 32, offset: 160)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !344, file: !345, line: 15, baseType: !6, size: 32, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !344, file: !345, line: 16, baseType: !6, size: 32, offset: 224)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !344, file: !345, line: 17, baseType: !6, size: 32, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !344, file: !345, line: 20, baseType: !44, size: 64, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !344, file: !345, line: 21, baseType: !37, size: 64, offset: 384)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!360 = !DISubprogram(name: "sigemptyset", scope: !273, file: !273, line: 199, type: !361, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!361 = !DISubroutineType(types: !362)
!362 = !{!6, !285}
!363 = !DISubprogram(name: "sigaction", scope: !273, file: !273, line: 243, type: !364, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!364 = !DISubroutineType(types: !365)
!365 = !{!6, !6, !366, !464}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !369, line: 27, size: 1216, elements: !370)
!369 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "", checksumkind: CSK_MD5, checksum: "cbe7184fa392cc2ddbd7b679f6e51ed3")
!370 = !{!371, !459, !461, !462}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !368, file: !369, line: 38, baseType: !372, size: 64)
!372 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !368, file: !369, line: 31, size: 64, elements: !373)
!373 = !{!374, !379}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !372, file: !369, line: 34, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !273, line: 72, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{null, !6}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !372, file: !369, line: 36, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{null, !6, !383, !40}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !385, line: 124, baseType: !386)
!385 = !DIFile(filename: "/usr/include/bits/types/siginfo_t.h", directory: "", checksumkind: CSK_MD5, checksum: "023cf7b0ef843da262cf07900eda0ac5")
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !385, line: 36, size: 1024, elements: !387)
!387 = !{!388, !389, !390, !391, !392}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !386, file: !385, line: 38, baseType: !6, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !386, file: !385, line: 40, baseType: !6, size: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !386, file: !385, line: 42, baseType: !6, size: 32, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !386, file: !385, line: 48, baseType: !6, size: 32, offset: 96)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !386, file: !385, line: 123, baseType: !393, size: 896, offset: 128)
!393 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !386, file: !385, line: 51, size: 896, elements: !394)
!394 = !{!395, !399, !405, !417, !423, !432, !448, !453}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !393, file: !385, line: 53, baseType: !396, size: 896)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 896, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 28, lowerBound: 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !393, file: !385, line: 60, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !393, file: !385, line: 56, size: 64, elements: !401)
!401 = !{!402, !404}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !400, file: !385, line: 58, baseType: !403, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !176, line: 154, baseType: !6)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !400, file: !385, line: 59, baseType: !225, size: 32, offset: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !393, file: !385, line: 68, baseType: !406, size: 128)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !393, file: !385, line: 63, size: 128, elements: !407)
!407 = !{!408, !409, !410}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !406, file: !385, line: 65, baseType: !6, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !406, file: !385, line: 66, baseType: !6, size: 32, offset: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !406, file: !385, line: 67, baseType: !411, size: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !412, line: 30, baseType: !413)
!412 = !DIFile(filename: "/usr/include/bits/types/__sigval_t.h", directory: "", checksumkind: CSK_MD5, checksum: "1d09b9e07a9c087acf39bd10c90b845a")
!413 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !412, line: 24, size: 64, elements: !414)
!414 = !{!415, !416}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !413, file: !412, line: 26, baseType: !6, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !413, file: !412, line: 27, baseType: !40, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !393, file: !385, line: 76, baseType: !418, size: 128)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !393, file: !385, line: 71, size: 128, elements: !419)
!419 = !{!420, !421, !422}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !418, file: !385, line: 73, baseType: !403, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !418, file: !385, line: 74, baseType: !225, size: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !418, file: !385, line: 75, baseType: !411, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !393, file: !385, line: 86, baseType: !424, size: 256)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !393, file: !385, line: 79, size: 256, elements: !425)
!425 = !{!426, !427, !428, !429, !431}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !424, file: !385, line: 81, baseType: !403, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !424, file: !385, line: 82, baseType: !225, size: 32, offset: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !424, file: !385, line: 83, baseType: !6, size: 32, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !424, file: !385, line: 84, baseType: !430, size: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !176, line: 156, baseType: !44)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !424, file: !385, line: 85, baseType: !430, size: 64, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !393, file: !385, line: 105, baseType: !433, size: 256)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !393, file: !385, line: 89, size: 256, elements: !434)
!434 = !{!435, !436, !438}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !433, file: !385, line: 91, baseType: !40, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !433, file: !385, line: 93, baseType: !437, size: 16, offset: 64)
!437 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !433, file: !385, line: 104, baseType: !439, size: 128, offset: 128)
!439 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !433, file: !385, line: 94, size: 128, elements: !440)
!440 = !{!441, !446}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !439, file: !385, line: 101, baseType: !442, size: 128)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !439, file: !385, line: 97, size: 128, elements: !443)
!443 = !{!444, !445}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !442, file: !385, line: 99, baseType: !40, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !442, file: !385, line: 100, baseType: !40, size: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !439, file: !385, line: 103, baseType: !447, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !176, line: 42, baseType: !28)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !393, file: !385, line: 112, baseType: !449, size: 128)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !393, file: !385, line: 108, size: 128, elements: !450)
!450 = !{!451, !452}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !449, file: !385, line: 110, baseType: !44, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !449, file: !385, line: 111, baseType: !6, size: 32, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !393, file: !385, line: 121, baseType: !454, size: 128)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !393, file: !385, line: 116, size: 128, elements: !455)
!455 = !{!456, !457, !458}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !454, file: !385, line: 118, baseType: !40, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !454, file: !385, line: 119, baseType: !6, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !454, file: !385, line: 120, baseType: !28, size: 32, offset: 96)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !368, file: !369, line: 46, baseType: !460, size: 1024, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !279, line: 8, baseType: !278)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !368, file: !369, line: 49, baseType: !6, size: 32, offset: 1088)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !368, file: !369, line: 52, baseType: !463, size: 64, offset: 1152)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!465 = !DISubprogram(name: "sigaddset", scope: !273, file: !273, line: 205, type: !466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!466 = !DISubroutineType(types: !467)
!467 = !{!6, !285, !6}
!468 = !DISubprogram(name: "sigismember", scope: !273, file: !273, line: 211, type: !469, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!469 = !DISubroutineType(types: !470)
!470 = !{!6, !276, !6}
!471 = !DISubprogram(name: "signal", scope: !273, file: !273, line: 88, type: !472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!472 = !DISubroutineType(types: !473)
!473 = !{!376, !6, !376}
!474 = !DISubprogram(name: "raise", scope: !273, file: !273, line: 123, type: !145, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!475 = !DISubprogram(name: "rpl_fclose", scope: !149, file: !149, line: 668, type: !150, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!476 = !{!477, !479, !481, !483, !485, !487, !489, !491, !493, !495, !500, !505, !510, !515, !518, !520, !94, !522, !524, !526, !528, !530, !532, !534, !537, !539, !541, !543, !548, !550, !552, !554, !556, !558, !560, !565, !570, !572, !574, !576, !584, !586, !588, !593, !595, !597, !599, !601, !604, !606, !608, !610, !629, !631, !633, !655, !659, !661, !663, !667, !669, !690, !695, !701, !703, !705, !708}
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "to_stdout", scope: !96, file: !97, line: 157, type: !6, isLocal: false, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "verbose", scope: !96, file: !97, line: 165, type: !6, isLocal: false, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "quiet", scope: !96, file: !97, line: 166, type: !6, isLocal: false, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "test", scope: !96, file: !97, line: 168, type: !6, isLocal: false, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "maxbits", scope: !96, file: !97, line: 171, type: !6, isLocal: false, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "method", scope: !96, file: !97, line: 172, type: !6, isLocal: false, isDefinition: true)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "level", scope: !96, file: !97, line: 173, type: !6, isLocal: false, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "exit_code", scope: !96, file: !97, line: 174, type: !6, isLocal: false, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "rsync", scope: !96, file: !97, line: 220, type: !6, isLocal: false, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "inbuf", scope: !96, file: !97, line: 131, type: !497, isLocal: false, isDefinition: true)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 262656, elements: !498)
!498 = !{!499}
!499 = !DISubrange(count: 32832, lowerBound: 0)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "outbuf", scope: !96, file: !97, line: 132, type: !502, isLocal: false, isDefinition: true)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 147456, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 18432, lowerBound: 0)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "d_buf", scope: !96, file: !97, line: 133, type: !507, isLocal: false, isDefinition: true)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 524288, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 32768, lowerBound: 0)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "window", scope: !96, file: !97, line: 134, type: !512, isLocal: false, isDefinition: true)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 524288, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 65536, lowerBound: 0)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "prev", scope: !96, file: !97, line: 136, type: !517, isLocal: false, isDefinition: true)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1048576, elements: !513)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "presume_input_tty", scope: !96, file: !97, line: 146, type: !318, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "synchronous", scope: !96, file: !97, line: 154, type: !318, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "save_orig_name", scope: !96, file: !97, line: 175, type: !6, isLocal: false, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "ifile_size", scope: !96, file: !97, line: 178, type: !331, isLocal: false, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "env", scope: !96, file: !97, line: 179, type: !26, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "z_suffix", scope: !96, file: !97, line: 180, type: !37, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "z_len", scope: !96, file: !97, line: 181, type: !198, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "time_stamp", scope: !96, file: !97, line: 189, type: !236, isLocal: false, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "exiting_signal", scope: !96, file: !97, line: 197, type: !536, isLocal: true, isDefinition: true)
!536 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !6)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "stdin_was_read", scope: !96, file: !97, line: 204, type: !318, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "bytes_in", scope: !96, file: !97, line: 206, type: !331, isLocal: false, isDefinition: true)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "bytes_out", scope: !96, file: !97, line: 207, type: !331, isLocal: false, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "ifname", scope: !96, file: !97, line: 210, type: !545, isLocal: false, isDefinition: true)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8192, elements: !546)
!546 = !{!547}
!547 = !DISubrange(count: 1024, lowerBound: 0)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "ofname", scope: !96, file: !97, line: 211, type: !545, isLocal: false, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "ifd", scope: !96, file: !97, line: 214, type: !6, isLocal: false, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "ofd", scope: !96, file: !97, line: 215, type: !6, isLocal: false, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "insize", scope: !96, file: !97, line: 217, type: !28, isLocal: false, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "inptr", scope: !96, file: !97, line: 218, type: !28, isLocal: false, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "outcnt", scope: !96, file: !97, line: 219, type: !28, isLocal: false, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "shortopts", scope: !96, file: !97, line: 257, type: !562, isLocal: true, isDefinition: true)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 272, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 34, lowerBound: 0)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "longopts", scope: !96, file: !97, line: 259, type: !567, isLocal: true, isDefinition: true)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 6912, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 27, lowerBound: 0)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "ascii", scope: !96, file: !97, line: 156, type: !6, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "decompress", scope: !96, file: !97, line: 158, type: !6, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "force", scope: !96, file: !97, line: 159, type: !6, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "help_msg", scope: !578, file: !97, line: 337, type: !583, isLocal: true, isDefinition: true)
!578 = distinct !DISubprogram(name: "help", scope: !97, file: !97, line: 335, type: !13, scopeLine: 336, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !96, retainedNodes: !579)
!579 = !{!580}
!580 = !DILocalVariable(name: "p", scope: !578, file: !97, line: 381, type: !581)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 1792, elements: !397)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "keep", scope: !96, file: !97, line: 160, type: !6, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "list", scope: !96, file: !97, line: 164, type: !6, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "license_msg", scope: !96, file: !97, line: 31, type: !590, isLocal: true, isDefinition: true)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 384, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 6, lowerBound: 0)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "no_time", scope: !96, file: !97, line: 162, type: !6, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "no_name", scope: !96, file: !97, line: 161, type: !6, isLocal: true, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "recursive", scope: !96, file: !97, line: 163, type: !6, isLocal: true, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "do_lzw", scope: !96, file: !97, line: 167, type: !6, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "work", scope: !96, file: !97, line: 318, type: !603, isLocal: true, isDefinition: true)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "istat", scope: !96, file: !97, line: 213, type: !213, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "part_nb", scope: !96, file: !97, line: 177, type: !6, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "last_member", scope: !96, file: !97, line: 176, type: !6, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "suffixes", scope: !612, file: !97, line: 1287, type: !628, isLocal: true, isDefinition: true)
!612 = distinct !DISubprogram(name: "open_input_file", scope: !97, file: !97, line: 1281, type: !613, scopeLine: 1284, flags: DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !96, retainedNodes: !615)
!613 = !DISubroutineType(types: !614)
!614 = !{!6, !26, !212}
!615 = !{!616, !617, !618, !619, !620, !622, !623, !624, !625, !627}
!616 = !DILocalVariable(name: "iname", arg: 1, scope: !612, file: !97, line: 1282, type: !26)
!617 = !DILocalVariable(name: "sbuf", arg: 2, scope: !612, file: !97, line: 1283, type: !212)
!618 = !DILocalVariable(name: "ilen", scope: !612, file: !97, line: 1285, type: !6)
!619 = !DILocalVariable(name: "z_suffix_errno", scope: !612, file: !97, line: 1286, type: !6)
!620 = !DILocalVariable(name: "suf", scope: !612, file: !97, line: 1288, type: !621)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!622 = !DILocalVariable(name: "s", scope: !612, file: !97, line: 1289, type: !37)
!623 = !DILocalVariable(name: "fd", scope: !612, file: !97, line: 1293, type: !6)
!624 = !DILocalVariable(name: "open_flags", scope: !612, file: !97, line: 1294, type: !6)
!625 = !DILocalVariable(name: "s0", scope: !626, file: !97, line: 1331, type: !37)
!626 = distinct !DILexicalBlock(scope: !612, file: !97, line: 1330, column: 8)
!627 = !DILabel(scope: !612, name: "name_too_long", file: !97, line: 1370)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 384, elements: !591)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "dot", scope: !96, file: !97, line: 819, type: !38, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "dfname", scope: !96, file: !97, line: 212, type: !545, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "known_suffixes", scope: !635, file: !97, line: 1170, type: !654, isLocal: true, isDefinition: true)
!635 = distinct !DISubprogram(name: "get_suffix", scope: !97, file: !97, line: 1165, type: !117, scopeLine: 1167, flags: DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !96, retainedNodes: !636)
!636 = !{!637, !638, !639, !640, !644, !645, !646, !650, !651, !652}
!637 = !DILocalVariable(name: "name", arg: 1, scope: !635, file: !97, line: 1166, type: !26)
!638 = !DILocalVariable(name: "nlen", scope: !635, file: !97, line: 1168, type: !6)
!639 = !DILocalVariable(name: "slen", scope: !635, file: !97, line: 1168, type: !6)
!640 = !DILocalVariable(name: "suffix", scope: !635, file: !97, line: 1169, type: !641)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 264, elements: !642)
!642 = !{!643}
!643 = !DISubrange(count: 33, lowerBound: 0)
!644 = !DILocalVariable(name: "suf", scope: !635, file: !97, line: 1176, type: !621)
!645 = !DILocalVariable(name: "suffix_of_builtin", scope: !635, file: !97, line: 1177, type: !318)
!646 = !DILocalVariable(name: "suflen", scope: !647, file: !97, line: 1183, type: !198)
!647 = distinct !DILexicalBlock(scope: !648, file: !97, line: 1182, column: 7)
!648 = distinct !DILexicalBlock(scope: !649, file: !97, line: 1181, column: 5)
!649 = distinct !DILexicalBlock(scope: !635, file: !97, line: 1181, column: 5)
!650 = !DILocalVariable(name: "z_lower", scope: !635, file: !97, line: 1191, type: !26)
!651 = !DILocalVariable(name: "match", scope: !635, file: !97, line: 1206, type: !26)
!652 = !DILocalVariable(name: "s", scope: !653, file: !97, line: 1208, type: !6)
!653 = distinct !DILexicalBlock(scope: !635, file: !97, line: 1207, column: 8)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 640, elements: !89)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "remove_ofname", scope: !96, file: !97, line: 202, type: !657, isLocal: true, isDefinition: true)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !658, size: 8192, elements: !546)
!658 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !27)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "foreground", scope: !96, file: !97, line: 169, type: !6, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(name: "dfd", scope: !96, file: !97, line: 216, type: !6, isLocal: true, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "caught_signals", scope: !96, file: !97, line: 192, type: !665, isLocal: true, isDefinition: true)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !666, line: 7, baseType: !460)
!666 = !DIFile(filename: "/usr/include/bits/types/sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "c2b978aaf49d5c0e2b1e9c2e1b7f7848")
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "remove_ofname_fd", scope: !96, file: !97, line: 201, type: !536, isLocal: true, isDefinition: true)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "first_time", scope: !671, file: !97, line: 1727, type: !6, isLocal: true, isDefinition: true)
!671 = distinct !DISubprogram(name: "do_list", scope: !97, file: !97, line: 1722, type: !672, scopeLine: 1725, flags: DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !96, retainedNodes: !674)
!672 = !DISubroutineType(types: !673)
!673 = !{null, !6, !6}
!674 = !{!675, !676, !677, !678, !679, !687}
!675 = !DILocalVariable(name: "ifd", arg: 1, scope: !671, file: !97, line: 1723, type: !6)
!676 = !DILocalVariable(name: "method", arg: 2, scope: !671, file: !97, line: 1724, type: !6)
!677 = !DILocalVariable(name: "crc", scope: !671, file: !97, line: 1726, type: !49)
!678 = !DILocalVariable(name: "positive_off_t_width", scope: !671, file: !97, line: 1735, type: !6)
!679 = !DILocalVariable(name: "buf", scope: !680, file: !97, line: 1778, type: !684)
!680 = distinct !DILexicalBlock(scope: !681, file: !97, line: 1777, column: 30)
!681 = distinct !DILexicalBlock(scope: !682, file: !97, line: 1777, column: 13)
!682 = distinct !DILexicalBlock(scope: !683, file: !97, line: 1769, column: 45)
!683 = distinct !DILexicalBlock(scope: !671, file: !97, line: 1769, column: 9)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 8, lowerBound: 0)
!687 = !DILocalVariable(name: "tm", scope: !688, file: !97, line: 1793, type: !343)
!688 = distinct !DILexicalBlock(scope: !689, file: !97, line: 1789, column: 7)
!689 = distinct !DILexicalBlock(scope: !671, file: !97, line: 1788, column: 9)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(name: "methods", scope: !671, file: !97, line: 1728, type: !692, isLocal: true, isDefinition: true)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 576, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 9, lowerBound: 0)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "month_abbr", scope: !671, file: !97, line: 1790, type: !697, isLocal: true, isDefinition: true)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 384, elements: !698)
!698 = !{!699, !700}
!699 = !DISubrange(count: 12, lowerBound: 0)
!700 = !DISubrange(count: 4, lowerBound: 0)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "total_in", scope: !96, file: !97, line: 208, type: !331, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "total_out", scope: !96, file: !97, line: 209, type: !331, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "handled_sig", scope: !96, file: !97, line: 222, type: !707, isLocal: true, isDefinition: true)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 192, elements: !591)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(name: "in_exit", scope: !710, file: !97, line: 2083, type: !6, isLocal: true, isDefinition: true)
!710 = distinct !DISubprogram(name: "do_exit", scope: !97, file: !97, line: 2080, type: !377, scopeLine: 2082, flags: DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !96, retainedNodes: !711)
!711 = !{!712}
!712 = !DILocalVariable(name: "exitcode", arg: 1, scope: !710, file: !97, line: 2081, type: !6)
!713 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!714 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!715 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!716 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!717 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!718 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!719 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!720 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!721 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!722 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!723 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!724 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "bk", scope: !727, file: !728, line: 212, type: !28, isLocal: true, isDefinition: true)
!727 = distinct !DICompileUnit(language: DW_LANG_C99, file: !728, producer: "clang version 10.0.0 (GraalVM.org llvmorg-10.0.0-5-g67b19b2aed-bgb23ce12f48 67b19b2aedf7dca7524aa26ac6b420213017c8e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !729, globals: !741, splitDebugInlining: false, nameTableKind: None)
!728 = !DIFile(filename: "inflate.c", directory: "/home/arthur/Downloads/gzip-1.10", checksumkind: CSK_MD5, checksum: "d66fc5af10e13eb2b5571bcbd8b2b172")
!729 = !{!730, !49, !7, !255, !6, !28, !40, !39, !731, !10, !139}
!730 = !DISubprogram(name: "flush_window", scope: !8, file: !8, line: 300, type: !13, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "huft", file: !728, line: 133, size: 128, elements: !733)
!733 = !{!734, !735, !736}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !732, file: !728, line: 134, baseType: !7, size: 8)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !732, file: !728, line: 135, baseType: !7, size: 8, offset: 8)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !732, file: !728, line: 139, baseType: !737, size: 64, offset: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !732, file: !728, line: 136, size: 64, elements: !738)
!738 = !{!739, !740}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !737, file: !728, line: 137, baseType: !10, size: 16)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !737, file: !728, line: 138, baseType: !731, size: 64)
!741 = !{!742, !725, !744, !746, !751, !756, !758, !763, !765, !767, !772}
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "bb", scope: !727, file: !728, line: 211, type: !49, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(name: "hufts", scope: !727, file: !728, line: 269, type: !28, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "border", scope: !727, file: !728, line: 160, type: !748, isLocal: true, isDefinition: true)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 608, elements: !749)
!749 = !{!750}
!750 = !DISubrange(count: 19, lowerBound: 0)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "mask_bits", scope: !727, file: !728, line: 214, type: !753, isLocal: true, isDefinition: true)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 272, elements: !754)
!754 = !{!755}
!755 = !DISubrange(count: 17, lowerBound: 0)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(name: "lbits", scope: !727, file: !728, line: 260, type: !6, isLocal: true, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(name: "cplens", scope: !727, file: !728, line: 162, type: !760, isLocal: true, isDefinition: true)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 496, elements: !761)
!761 = !{!762}
!762 = !DISubrange(count: 31, lowerBound: 0)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "cplext", scope: !727, file: !728, line: 166, type: !760, isLocal: true, isDefinition: true)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "dbits", scope: !727, file: !728, line: 261, type: !6, isLocal: true, isDefinition: true)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "cpdist", scope: !727, file: !728, line: 169, type: !769, isLocal: true, isDefinition: true)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 480, elements: !770)
!770 = !{!771}
!771 = !DISubrange(count: 30, lowerBound: 0)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "cpdext", scope: !727, file: !728, line: 173, type: !769, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "file_type", scope: !776, file: !777, line: 289, type: !910, isLocal: true, isDefinition: true)
!776 = distinct !DICompileUnit(language: DW_LANG_C99, file: !777, producer: "clang version 10.0.0 (GraalVM.org llvmorg-10.0.0-5-g67b19b2aed-bgb23ce12f48 67b19b2aedf7dca7524aa26ac6b420213017c8e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !778, globals: !813, splitDebugInlining: false, nameTableKind: None)
!777 = !DIFile(filename: "trees.c", directory: "/home/arthur/Downloads/gzip-1.10", checksumkind: CSK_MD5, checksum: "0b7133aa56db91b754723fe53516c736")
!778 = !{!7, !779, !793, !10, !796, !34, !28, !807, !26, !810, !811, !49, !44, !812}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "ct_data", file: !777, line: 179, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ct_data", file: !777, line: 170, size: 32, elements: !782)
!782 = !{!783, !788}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !781, file: !777, line: 174, baseType: !784, size: 16)
!784 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !781, file: !777, line: 171, size: 16, elements: !785)
!785 = !{!786, !787}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "freq", scope: !784, file: !777, line: 172, baseType: !10, size: 16)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !784, file: !777, line: 173, baseType: !10, size: 16)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !781, file: !777, line: 178, baseType: !789, size: 16, offset: 16)
!789 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !781, file: !777, line: 175, size: 16, elements: !790)
!790 = !{!791, !792}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "dad", scope: !789, file: !777, line: 176, baseType: !10, size: 16)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !789, file: !777, line: 177, baseType: !10, size: 16)
!793 = !DISubprogram(name: "bi_reverse", scope: !8, file: !8, line: 289, type: !794, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!794 = !DISubroutineType(types: !795)
!795 = !{!28, !28, !6}
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree_desc", file: !777, line: 215, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_desc", file: !777, line: 207, size: 320, elements: !799)
!799 = !{!800, !801, !802, !803, !804, !805, !806}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_tree", scope: !798, file: !777, line: 208, baseType: !779, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "static_tree", scope: !798, file: !777, line: 209, baseType: !779, size: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "extra_bits", scope: !798, file: !777, line: 210, baseType: !122, size: 64, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "extra_base", scope: !798, file: !777, line: 211, baseType: !6, size: 32, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !798, file: !777, line: 212, baseType: !6, size: 32, offset: 224)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "max_length", scope: !798, file: !777, line: 213, baseType: !6, size: 32, offset: 256)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "max_code", scope: !798, file: !777, line: 214, baseType: !6, size: 32, offset: 288)
!807 = !DISubprogram(name: "copy_block", scope: !8, file: !8, line: 291, type: !808, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!808 = !DISubroutineType(types: !809)
!809 = !{null, !26, !28, !6}
!810 = !DISubprogram(name: "send_bits", scope: !8, file: !8, line: 288, type: !672, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!811 = !DISubprogram(name: "bi_windup", scope: !8, file: !8, line: 290, type: !13, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!812 = !DISubprogram(name: "warning", scope: !8, file: !8, line: 310, type: !35, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!813 = !{!814, !819, !824, !829, !832, !835, !840, !845, !850, !853, !858, !860, !862, !864, !866, !868, !870, !872, !875, !774, !877, !879, !881, !883, !888, !890, !892, !895, !898, !900, !902, !904, !907}
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(name: "dyn_ltree", scope: !776, file: !777, line: 189, type: !816, isLocal: true, isDefinition: true)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !780, size: 18336, elements: !817)
!817 = !{!818}
!818 = !DISubrange(count: 573, lowerBound: 0)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "dyn_dtree", scope: !776, file: !777, line: 190, type: !821, isLocal: true, isDefinition: true)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !780, size: 1952, elements: !822)
!822 = !{!823}
!823 = !DISubrange(count: 61, lowerBound: 0)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(name: "static_ltree", scope: !776, file: !777, line: 192, type: !826, isLocal: true, isDefinition: true)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !780, size: 9216, elements: !827)
!827 = !{!828}
!828 = !DISubrange(count: 288, lowerBound: 0)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "static_dtree", scope: !776, file: !777, line: 199, type: !831, isLocal: true, isDefinition: true)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !780, size: 960, elements: !770)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(name: "bl_count", scope: !776, file: !777, line: 227, type: !834, isLocal: true, isDefinition: true)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 256, elements: !283)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "length_code", scope: !776, file: !777, line: 246, type: !837, isLocal: true, isDefinition: true)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2048, elements: !838)
!838 = !{!839}
!839 = !DISubrange(count: 256, lowerBound: 0)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(name: "dist_code", scope: !776, file: !777, line: 249, type: !842, isLocal: true, isDefinition: true)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 4096, elements: !843)
!843 = !{!844}
!844 = !DISubrange(count: 512, lowerBound: 0)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "base_length", scope: !776, file: !777, line: 255, type: !847, isLocal: true, isDefinition: true)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 928, elements: !848)
!848 = !{!849}
!849 = !DISubrange(count: 29, lowerBound: 0)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(name: "base_dist", scope: !776, file: !777, line: 258, type: !852, isLocal: true, isDefinition: true)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 960, elements: !770)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "flag_buf", scope: !776, file: !777, line: 266, type: !855, isLocal: true, isDefinition: true)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32768, elements: !856)
!856 = !{!857}
!857 = !DISubrange(count: 4096, lowerBound: 0)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "last_lit", scope: !776, file: !777, line: 271, type: !28, isLocal: true, isDefinition: true)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "last_dist", scope: !776, file: !777, line: 272, type: !28, isLocal: true, isDefinition: true)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(name: "last_flags", scope: !776, file: !777, line: 273, type: !28, isLocal: true, isDefinition: true)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(name: "flags", scope: !776, file: !777, line: 274, type: !7, isLocal: true, isDefinition: true)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(name: "flag_bit", scope: !776, file: !777, line: 275, type: !7, isLocal: true, isDefinition: true)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "opt_len", scope: !776, file: !777, line: 281, type: !49, isLocal: true, isDefinition: true)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "static_len", scope: !776, file: !777, line: 282, type: !49, isLocal: true, isDefinition: true)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "compressed_len", scope: !776, file: !777, line: 284, type: !874, isLocal: true, isDefinition: true)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !254, line: 63, baseType: !175)
!875 = !DIGlobalVariableExpression(var: !876, expr: !DIExpression())
!876 = distinct !DIGlobalVariable(name: "input_len", scope: !776, file: !777, line: 286, type: !874, isLocal: true, isDefinition: true)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(name: "file_method", scope: !776, file: !777, line: 290, type: !122, isLocal: true, isDefinition: true)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(name: "extra_lbits", scope: !776, file: !777, line: 104, type: !847, isLocal: true, isDefinition: true)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(name: "extra_dbits", scope: !776, file: !777, line: 107, type: !852, isLocal: true, isDefinition: true)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(name: "bl_tree", scope: !776, file: !777, line: 204, type: !885, isLocal: true, isDefinition: true)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !780, size: 1248, elements: !886)
!886 = !{!887}
!887 = !DISubrange(count: 39, lowerBound: 0)
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(name: "heap_len", scope: !776, file: !777, line: 237, type: !6, isLocal: true, isDefinition: true)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "heap_max", scope: !776, file: !777, line: 238, type: !6, isLocal: true, isDefinition: true)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(name: "heap", scope: !776, file: !777, line: 236, type: !894, isLocal: true, isDefinition: true)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 18336, elements: !817)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(name: "depth", scope: !776, file: !777, line: 243, type: !897, isLocal: true, isDefinition: true)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 4584, elements: !817)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "l_desc", scope: !776, file: !777, line: 217, type: !797, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "d_desc", scope: !776, file: !777, line: 220, type: !797, isLocal: true, isDefinition: true)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(name: "bl_desc", scope: !776, file: !777, line: 223, type: !797, isLocal: true, isDefinition: true)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(name: "extra_blbits", scope: !776, file: !777, line: 110, type: !906, isLocal: true, isDefinition: true)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 608, elements: !749)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(name: "bl_order", scope: !776, file: !777, line: 230, type: !909, isLocal: true, isDefinition: true)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 152, elements: !749)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!912 = distinct !DIGlobalVariable(name: "done", scope: !913, file: !914, line: 325, type: !6, isLocal: true, isDefinition: true)
!913 = distinct !DICompileUnit(language: DW_LANG_C99, file: !914, producer: "clang version 10.0.0 (GraalVM.org llvmorg-10.0.0-5-g67b19b2aed-bgb23ce12f48 67b19b2aedf7dca7524aa26ac6b420213017c8e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !915, globals: !916, splitDebugInlining: false, nameTableKind: None)
!914 = !DIFile(filename: "unlzh.c", directory: "/home/arthur/Downloads/gzip-1.10", checksumkind: CSK_MD5, checksum: "17325647a68256a0534666f19c2e1899")
!915 = !{!28, !26, !264, !255, !6, !34}
!916 = !{!917, !918, !920, !922, !924, !926, !928, !938, !943}
!917 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(name: "bitbuf", scope: !913, file: !914, line: 98, type: !10, isLocal: true, isDefinition: true)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(name: "subbitbuf", scope: !913, file: !914, line: 99, type: !28, isLocal: true, isDefinition: true)
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(name: "bitcount", scope: !913, file: !914, line: 100, type: !6, isLocal: true, isDefinition: true)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(name: "blocksize", scope: !913, file: !914, line: 85, type: !28, isLocal: true, isDefinition: true)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(name: "j", scope: !913, file: !914, line: 324, type: !6, isLocal: true, isDefinition: true)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(name: "i", scope: !930, file: !914, line: 348, type: !28, isLocal: true, isDefinition: true)
!930 = distinct !DISubprogram(name: "decode", scope: !914, file: !914, line: 336, type: !931, scopeLine: 347, flags: DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !913, retainedNodes: !933)
!931 = !DISubroutineType(types: !932)
!932 = !{!28, !28, !262}
!933 = !{!934, !935, !936, !937}
!934 = !DILocalVariable(name: "count", arg: 1, scope: !930, file: !914, line: 337, type: !28)
!935 = !DILocalVariable(name: "buffer", arg: 2, scope: !930, file: !914, line: 338, type: !262)
!936 = !DILocalVariable(name: "r", scope: !930, file: !914, line: 349, type: !28)
!937 = !DILocalVariable(name: "c", scope: !930, file: !914, line: 349, type: !28)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "pt_len", scope: !913, file: !914, line: 84, type: !940, isLocal: true, isDefinition: true)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !941)
!941 = !{!942}
!942 = !DISubrange(count: 32, lowerBound: 0)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(name: "pt_table", scope: !913, file: !914, line: 86, type: !945, isLocal: true, isDefinition: true)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 4096, elements: !838)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(name: "block_mode", scope: !948, file: !949, line: 88, type: !6, isLocal: false, isDefinition: true)
!948 = distinct !DICompileUnit(language: DW_LANG_C99, file: !949, producer: "clang version 10.0.0 (GraalVM.org llvmorg-10.0.0-5-g67b19b2aed-bgb23ce12f48 67b19b2aedf7dca7524aa26ac6b420213017c8e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !950, globals: !958, splitDebugInlining: false, nameTableKind: None)
!949 = !DIFile(filename: "unlzw.c", directory: "/home/arthur/Downloads/gzip-1.10", checksumkind: CSK_MD5, checksum: "553c2704854f1779d1f4624a4b45d75b")
!950 = !{!255, !28, !39, !951, !26, !952, !147, !955, !44, !34, !6, !956, !264, !957, !11}
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_type", file: !949, line: 19, baseType: !9)
!952 = !DISubprogram(name: "read_buffer", scope: !8, file: !8, line: 302, type: !953, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!953 = !DISubroutineType(types: !954)
!954 = !{!6, !6, !40, !28}
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !144, line: 243, baseType: !175)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmp_code_int", file: !949, line: 23, baseType: !48)
!958 = !{!946}
!959 = !DIGlobalVariableExpression(var: !960, expr: !DIExpression())
!960 = distinct !DIGlobalVariable(name: "valid", scope: !961, file: !962, line: 76, type: !6, isLocal: true, isDefinition: true)
!961 = distinct !DICompileUnit(language: DW_LANG_C99, file: !962, producer: "clang version 10.0.0 (GraalVM.org llvmorg-10.0.0-5-g67b19b2aed-bgb23ce12f48 67b19b2aedf7dca7524aa26ac6b420213017c8e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !963, globals: !964, splitDebugInlining: false, nameTableKind: None)
!962 = !DIFile(filename: "unpack.c", directory: "/home/arthur/Downloads/gzip-1.10", checksumkind: CSK_MD5, checksum: "1c730c17513c9080ee4240295161510f")
!963 = !{!7, !730, !49, !34, !255}
!964 = !{!965, !967, !969, !971, !976, !978, !980, !982, !959}
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(name: "orig_len", scope: !961, file: !962, line: 41, type: !49, isLocal: true, isDefinition: true)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(name: "max_len", scope: !961, file: !962, line: 42, type: !6, isLocal: true, isDefinition: true)
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(name: "literal", scope: !961, file: !962, line: 44, type: !837, isLocal: true, isDefinition: true)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(name: "lit_base", scope: !961, file: !962, line: 49, type: !973, isLocal: true, isDefinition: true)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 832, elements: !974)
!974 = !{!975}
!975 = !DISubrange(count: 26, lowerBound: 0)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(name: "leaves", scope: !961, file: !962, line: 55, type: !973, isLocal: true, isDefinition: true)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(name: "parents", scope: !961, file: !962, line: 56, type: !973, isLocal: true, isDefinition: true)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(name: "peek_bits", scope: !961, file: !962, line: 58, type: !6, isLocal: true, isDefinition: true)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(name: "bitbuf", scope: !961, file: !962, line: 73, type: !49, isLocal: true, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(name: "decrypt", scope: !986, file: !987, line: 54, type: !6, isLocal: true, isDefinition: true)
!986 = distinct !DICompileUnit(language: DW_LANG_C99, file: !987, producer: "clang version 10.0.0 (GraalVM.org llvmorg-10.0.0-5-g67b19b2aed-bgb23ce12f48 67b19b2aedf7dca7524aa26ac6b420213017c8e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !988, globals: !994, splitDebugInlining: false, nameTableKind: None)
!987 = !DIFile(filename: "unzip.c", directory: "/home/arthur/Downloads/gzip-1.10", checksumkind: CSK_MD5, checksum: "953d78cc5c43343b289727fbce622989")
!988 = !{!10, !7, !49, !258, !989, !992, !34, !255, !730, !993}
!989 = !DISubprogram(name: "inflate", scope: !8, file: !8, line: 317, type: !990, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!990 = !DISubroutineType(types: !991)
!991 = !{!6}
!992 = !DISubprogram(name: "xalloc_die", scope: !8, file: !8, line: 309, type: !13, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !4)
!993 = !DISubprogram(name: "abort_gzip", scope: !8, file: !8, line: 275, type: !13, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !4)
!994 = !{!984, !995, !997}
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(name: "ext_header", scope: !986, file: !987, line: 56, type: !6, isLocal: true, isDefinition: true)
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(name: "pkzip", scope: !986, file: !987, line: 55, type: !6, isLocal: true, isDefinition: true)
!999 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(name: "crc", scope: !1002, file: !1003, line: 134, type: !49, isLocal: true, isDefinition: true)
!1002 = distinct !DISubprogram(name: "updcrc", scope: !1003, file: !1003, line: 128, type: !1004, scopeLine: 131, flags: DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1006, retainedNodes: !1080)
!1003 = !DIFile(filename: "util.c", directory: "/home/arthur/Downloads/gzip-1.10", checksumkind: CSK_MD5, checksum: "9c26e0dad993f53eb8a5a56a95bbad17")
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!49, !262, !28}
!1006 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1003, producer: "clang version 10.0.0 (GraalVM.org llvmorg-10.0.0-5-g67b19b2aed-bgb23ce12f48 67b19b2aedf7dca7524aa26ac6b420213017c8e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1007, retainedTypes: !1023, globals: !1075, splitDebugInlining: false, nameTableKind: None)
!1007 = !{!1008}
!1008 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1009, line: 46, baseType: !28, size: 32, elements: !1010)
!1009 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "fd7caa83cd0622339ddad5c2c7766455")
!1010 = !{!1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022}
!1011 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!1012 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!1013 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!1014 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!1015 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!1016 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!1017 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!1018 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!1019 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!1020 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!1021 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!1022 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
